# Цей файл створено спеціально для тестового середовища.
# Він використовує спрощені налаштування для прискорення тестів:
# - SQLite як базу даних у пам'яті (вона швидше за інші бази даних).
# - MD5 для хешування паролів (швидше, але менш безпечно, підходить лише для тестів).

from .settings import *

# Використовуємо SQLite для тестів бо вона швидше
DATABASES = {
    "default": {
        "ENGINE": "django.db.backends.sqlite3",  # Для тестів використовувати SQLite (швидше)
        "NAME": ":memory:", # Використовуємо базу даних в пам'яті
    }
}

# Використовуємо MD5 для хешування паролів у тестах це швидше, але менш безпечно 
PASSWORD_HASHERS = [
    "django.contrib.auth.hashers.MD5PasswordHasher", # Використовуємо MD5 для швидкого хешування паролів у тестах
]

# Вимкнення кешування для тестів
CACHES = {
    "default": {
        "BACKEND": "django.core.cache.backends.dummy.DummyCache", # Використовуємо DummyCache для тестів
    }
}